---
kind: method
id: M:Autodesk.Revit.DB.TransactWithCentralOptions.#ctor
source: html/a2a9b0c6-e379-27bb-8ed8-3ca77f885173.htm
---
# Autodesk.Revit.DB.TransactWithCentralOptions.#ctor Method

Constructs a new TransactWithCentralOptions.

## Syntax (C#)
```csharp
public TransactWithCentralOptions()
```